openfoam/OpenFOAM-dev/tutorials/incompressibleVoF/rotatingCube/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

#include "$FOAM_TUTORIALS/resources/blockMesh/mixerVessel2D"

baffles
{
    nonCouple
    {
        type        searchableSurface;
        surface     searchableCylinder;
        point1      (0 0 -100);
        point2      (0 0 100);
        radius      $rMid;

        owner
        {
            name        nonCouple1;
            type        patch;
        }

        neighbour
        {
            name        nonCouple2;
            type        patch;
        }
    }
}

// ************************************************************************* //
